ID	Original Question	Paraphrasing 1	Paraphrasing 2	SPARQL Query
Q12	Give me all actors called Baldwin .	Which are all actors known as Baldwin .	Who are the actors called Baldwin ?	SELECT DISTINCT ?uri WHERE { ?uri foaf:surname 'Baldwin'@en . { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Actor> . } UNION { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> . } }
Q9	Give me all books written by Danielle Steel .	what all books  Danielle Steel authored?	What are the books authored by Danielle Steel ?	SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Book> ; <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel> }
Q52	Give me the birth place of Frank Sinatra .	where was  Frank Sinatra  born?	Where was Frank Sinatra born?	PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?place WHERE { res:Frank_Sinatra dbo:birthPlace ?place }
Q96	Give me all Frisian islands that belong to the Netherlands .	Which are the Frisian islands that Netherland owns?	List out all Frisian islands that are in the territory of Netherlands .	PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type yago:WikicatFrisianIslands ; dbo:country res:Netherlands }
Q17	Give me a list of all lakes in Denmark .	Tell me the list of all lakes in Denmark .	What are the names of lakes in Denmark ?	SELECT DISTINCT ?uri WHERE { { ?uri a <http://dbpedia.org/ontology/Lake> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> } UNION { ?uri a <http://dbpedia.org/class/yago/LakesOfDenmark> } }
